# Вычислить число c заданной точностью d
d = int(input('Введите точность d = '))
pi = sum((1/16**n)*(4/(8*n + 1) - 2/(8*n + 4) - 1/(8*n + 5) - 1/(8*n + 6)) for n in range(d))
print(pi)